benchmarks/out/http.txt

--- BENCH HTTP START ---

--- GO STDLIB ---
2021/10/24 15:31:03 http server started on port 8081
*** 50 connections, 10 seconds
Bombarding http://127.0.0.1:8081 for 10s using 50 connection(s)
[=======================================================================================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     23363.11    2445.48   29482.11
  Latency        2.14ms   373.67us    15.42ms
  HTTP codes:
    1xx - 0, 2xx - 233550, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.30MB/s
--- DONE ---

--- FASTHTTP ---
fasthttp-server/main.go:12:2: no required module provides package github.com/valyala/fasthttp; to add it:
	go get github.com/valyala/fasthttp
--- BENCH HTTP DONE ---